//初始化加载数据，模拟本地数据库
var local_database= [
  {
    imgurl: '../../img/food4.jpg',
    detail_img:'../../../img/food4.jpg',
    content: "弯弯的黄河故道旁，有我美丽的家乡；水色连天向东流，万顷碧波荡漾；申甘林带锁风沙，一派幽林好风光……”一首新谣唱出了民权人民对申甘林的依恋",
    date: 'Apr 3 2018',
    like_num: 1100,
    // eye_num: 100,
    position:"left",
    postid:0,
    text:"发表于",
    title:"大好河山",
    author:'子凡',
    detail_cont: '古今中外,人们的爱国心是相通的. 正如法国大作家雨果所说：人们不能没有面包而生存；人们也不能没有祖国而生活.祖国是金铸的摇篮,让人依依不舍.正因为有了这样的感受,人们才会发出这样的感叹：“在祖国过一冬天,胜过在异国过一百个春天!\n中华民族是一个历史悠久的民族, 创造了璀璨的文化.在汉唐等时期, 我们祖国曾经是世界上最文明、最强大的国家.但是, 由于近代国家政治腐败, 闭关自守, 导致了国家国力衰微.新中国成立后, 在中国共产党的领导下, 经过改革开放的二十多年建设, 我们的国家实力日益增强, 人民生活水平迅速提高, 在祖国许许多多人民的共同努力下, 祖国变得一天比一天强大.然而, 在很久很久以前, 书信是普遍的.爸爸告诉我, 说他以前当兵的时候, 经常与家人通信, 一封信的来回要好几天.即使是十分急的时候也只有发电报, 但电报太贵了, 一个字就要3毛钱, 而那时爸爸家并不富裕, 所以爸爸发的电文是精简了又精简.随着祖国的发展, 爸爸家里有了座机, 他当兵的地方也有座机.就这样, 爸爸就可以时不时地听一听家人的声音.\n在祖国的飞速发展下, 没过几年, 爸爸就有了手机, 与家人联系就更方便了.从此爸爸再也没写过书信了.接下来, 我也出生了, 我知道爸爸手机都换了好几个了.后来, 由于我国电脑的普及, 我家买了电脑, 就可以上互联网发电邮、聊QQ了, 无论与谁通讯都十分方便——即使对方在“天涯海角”.世上最神圣的情感报发的是对祖国的真挚爱恋……我爱我的祖国、我要大声地赞美我的祖国!',
    music:{
      dataUrl: 'http://ws.stream.qqmusic.qq.com/M500001VfvsJ21xFqb.mp3?guid=ffffffff82def4af4b12b3cd9337d5e7&uin=346897220&vkey=6292F51E1E384E06DCBDC9AB7C49FD713D632D313AC4858BACB8DDD29067D3C601481D36E62053BF8DFEAF74C0A5CCFADD6471160CAF3E6A&fromtag=46',
      title: '此时此刻-1',
      coverImgUrl: 'http://img02.tooopen.com/images/20150928/tooopen_sy_143912755726.jpg'
    }
  },
  {
    imgurl: '../../img/food8.jpg',
    detail_img:'../../../img/food8.jpg',
    content: "青春理想，青春活力，青春奋斗，是中国精神和中国力量的生命力所在。",
    date: 'Apr 1 2018',
    like_num: 110,
    // eye_num: 190,
    position: "left",
    postid: 1,
    text: "发表于",    
    title: "奋斗吧，青年",
    author: '深入',
    detail_cont: '奋斗中的幸福，是青春在奉献中的升华。青年时代选择了吃苦就选择了收获，选择了奉献就选择了高尚。当马广超只身远赴青海玉树自费支教，在雪域高原坚守6年，教藏区的孩子读书写字，传播科学文化知识的时候，他的奋斗一定是幸福的。当冯黎明多次在危难时刻勇斗歹徒，组建义务反扒志愿者队伍，利用业余时间抓获违法犯罪分子的时候，他的奋斗一定是幸福的。还有，肩上担负着900户家庭、3600人健康需求的乡村医生陈伟琳；始终秉持“奉献无止境、燃烧到永远”的人生信条，连续18年无偿献血，累计献血3万多毫升的吴木之；用青春陪伴孤独症患儿的李小姣；危急时刻勇救老人导致右腿不幸被碾轧的徐前凯……他们的奋斗也一定是幸福的。正是无数这样的奋斗，铸就了高尚的精神品格，让社会变得更加温暖。幸福都是奋斗出来的！\n唯有奋斗，才能留下深深的印记；唯有奋斗，才能永葆青春的朝气。在新时代的伟大征程上，奋斗永远是我们最美丽的青春誓言。现在，让我们一起向奋斗的青春致敬！',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/M500001VfvsJ21xFqb.mp3?guid=ffffffff82def4af4b12b3cd9337d5e7&uin=346897220&vkey=6292F51E1E384E06DCBDC9AB7C49FD713D632D313AC4858BACB8DDD29067D3C601481D36E62053BF8DFEAF74C0A5CCFADD6471160CAF3E6A&fromtag=46',
      title: '此时此刻-2',
      coverImgUrl: 'http://img06.tooopen.com/images/20160818/tooopen_sy_175833047715.jpg'
    }
  },
  {
    imgurl: '../../img/g.jpg',
    detail_img:'../../../img/g.jpg',    
    content: "我在鼓楼的夜色中 为你唱花香自来在别处 沉默相遇和期待飞机飞过 车水马龙的城市千里之外 不离开",
    date: 'Apr 2 2018',
    like_num: 100,
    // eye_num: 180,
    position: "left",
    postid: 2  ,
    text: "发表于",    
    title: "春风十里",
    author: '春风',
    detail_cont: ' 春风十里，小酌。小酌一些故乡的情思，那条乡间的小路，也是满园香径应有时，也是满山几多春花开吗，抬头仰望那份天高云淡的悠然，旷野的深远，在小草的曼舞里恍若隔世。在春风十里间，也叹息时光的脚步怎么这么快，昨日桃花开在心间仿佛未落，今日在一朵朵笑靥里又一次相逢，脚步怎么就是迟了似得，是心呢，不想与昨日分个明白。我在花间浅笑，你在绕花轻舞，吹落一朵花于发间，就是你的问候。“东风随春归，发我枝上花。”仰望是一种姿态，仰望一朵花的高度，仰望一缕风的潺潺，若水的感觉，就在花间，在春风里恣意流淌成属于自己的春天。\n春风十里，那些散落在浪花里的呓语，那些随露珠滑落的念想，那些摇曳在风中隐隐而来的思念，打湿了哪一场春雨呢？那些微小的不易察觉的轻柔而过，是经年的执念，是一场又一场落幕后空空的剧院，耳边回荡着的是蒹葭青衣，刀马花旦。谁的围城里谁的雪域，在春风十里间，融化成涓涓细流。云水间，你又是轻歌曼舞的伊人呢，把每一寸光阴都焐热成一朵花散落在人间陌上。在一束束花开间，捧起那一朵娉婷的鹅黄。',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/M500001VfvsJ21xFqb.mp3?guid=ffffffff82def4af4b12b3cd9337d5e7&uin=346897220&vkey=6292F51E1E384E06DCBDC9AB7C49FD713D632D313AC4858BACB8DDD29067D3C601481D36E62053BF8DFEAF74C0A5CCFADD6471160CAF3E6A&fromtag=46',
      title: '此时此刻-3',
      coverImgUrl: 'http://img06.tooopen.com/images/20160818/tooopen_sy_175866434296.jpg',
    }
  },

  {
    imgurl: 'http://img02.tooopen.com/images/20150928/tooopen_sy_143912755726.jpg',
    detail_img: 'http://img02.tooopen.com/images/20150928/tooopen_sy_143912755726.jpg',
    content: "我在鼓楼的夜色中 为你唱花香自来在别处 沉默相遇和期待飞机飞过 车水马龙的城市千里之外 不离开",
    date: 'Apr 2 2018',
    like_num: 100,
    // eye_num: 180,
    position: "left",
    postid: 3,
    text: "发表于",
    title: "春风十里",
    author: '春风',
    detail_cont: ' 春风十里，小酌。小酌一些故乡的情思，那条乡间的小路，也是满园香径应有时，也是满山几多春花开吗，抬头仰望那份天高云淡的悠然，旷野的深远，在小草的曼舞里恍若隔世。在春风十里间，也叹息时光的脚步怎么这么快，昨日桃花开在心间仿佛未落，今日在一朵朵笑靥里又一次相逢，脚步怎么就是迟了似得，是心呢，不想与昨日分个明白。我在花间浅笑，你在绕花轻舞，吹落一朵花于发间，就是你的问候。“东风随春归，发我枝上花。”仰望是一种姿态，仰望一朵花的高度，仰望一缕风的潺潺，若水的感觉，就在花间，在春风里恣意流淌成属于自己的春天。\n春风十里，那些散落在浪花里的呓语，那些随露珠滑落的念想，那些摇曳在风中隐隐而来的思念，打湿了哪一场春雨呢？那些微小的不易察觉的轻柔而过，是经年的执念，是一场又一场落幕后空空的剧院，耳边回荡着的是蒹葭青衣，刀马花旦。谁的围城里谁的雪域，在春风十里间，融化成涓涓细流。云水间，你又是轻歌曼舞的伊人呢，把每一寸光阴都焐热成一朵花散落在人间陌上。在一束束花开间，捧起那一朵娉婷的鹅黄。',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/M500001VfvsJ21xFqb.mp3?guid=ffffffff82def4af4b12b3cd9337d5e7&uin=346897220&vkey=6292F51E1E384E06DCBDC9AB7C49FD713D632D313AC4858BACB8DDD29067D3C601481D36E62053BF8DFEAF74C0A5CCFADD6471160CAF3E6A&fromtag=46',
      title: '此时此刻-4',
      coverImgUrl: 'http://img06.tooopen.com/images/20160818/tooopen_sy_175866434296.jpg',
    }
  },

  {
    imgurl: 'http://img06.tooopen.com/images/20160818/tooopen_sy_175866434296.jpg',
    detail_img: 'http://img06.tooopen.com/images/20160818/tooopen_sy_175866434296.jpg',
    content: "我在鼓楼的夜色中 为你唱花香自来在别处 沉默相遇和期待飞机飞过 车水马龙的城市千里之外 不离开",
    date: 'Apr 2 2018',
    like_num: 100,
    // eye_num: 180,
    position: "left",
    postid: 4,
    text: "发表于",
    title: "春风十里",
    author: '春风',
    detail_cont: ' 春风十里，小酌。小酌一些故乡的情思，那条乡间的小路，也是满园香径应有时，也是满山几多春花开吗，抬头仰望那份天高云淡的悠然，旷野的深远，在小草的曼舞里恍若隔世。在春风十里间，也叹息时光的脚步怎么这么快，昨日桃花开在心间仿佛未落，今日在一朵朵笑靥里又一次相逢，脚步怎么就是迟了似得，是心呢，不想与昨日分个明白。我在花间浅笑，你在绕花轻舞，吹落一朵花于发间，就是你的问候。“东风随春归，发我枝上花。”仰望是一种姿态，仰望一朵花的高度，仰望一缕风的潺潺，若水的感觉，就在花间，在春风里恣意流淌成属于自己的春天。\n春风十里，那些散落在浪花里的呓语，那些随露珠滑落的念想，那些摇曳在风中隐隐而来的思念，打湿了哪一场春雨呢？那些微小的不易察觉的轻柔而过，是经年的执念，是一场又一场落幕后空空的剧院，耳边回荡着的是蒹葭青衣，刀马花旦。谁的围城里谁的雪域，在春风十里间，融化成涓涓细流。云水间，你又是轻歌曼舞的伊人呢，把每一寸光阴都焐热成一朵花散落在人间陌上。在一束束花开间，捧起那一朵娉婷的鹅黄。',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/M500001VfvsJ21xFqb.mp3?guid=ffffffff82def4af4b12b3cd9337d5e7&uin=346897220&vkey=6292F51E1E384E06DCBDC9AB7C49FD713D632D313AC4858BACB8DDD29067D3C601481D36E62053BF8DFEAF74C0A5CCFADD6471160CAF3E6A&fromtag=46',
      title: '此时此刻-5',
      coverImgUrl: 'http://img06.tooopen.com/images/20160818/tooopen_sy_175866434296.jpg',
    }
  },

  {
    imgurl: 'http://img06.tooopen.com/images/20160818/tooopen_sy_175833047715.jpg',

    detail_img: 'http://img06.tooopen.com/images/20160818/tooopen_sy_175833047715.jpg',

    content: "我在鼓楼的夜色中 为你唱花香自来在别处 沉默相遇和期待飞机飞过 车水马龙的城市千里之外 不离开",
    date: 'Apr 2 2018',
    like_num: 100,
    // eye_num: 180,
    position: "left",
    postid: 5,
    text: "发表于",
    title: "春风十里",
    author: '春风',
    detail_cont: ' 春风十里，小酌。小酌一些故乡的情思，那条乡间的小路，也是满园香径应有时，也是满山几多春花开吗，抬头仰望那份天高云淡的悠然，旷野的深远，在小草的曼舞里恍若隔世。在春风十里间，也叹息时光的脚步怎么这么快，昨日桃花开在心间仿佛未落，今日在一朵朵笑靥里又一次相逢，脚步怎么就是迟了似得，是心呢，不想与昨日分个明白。我在花间浅笑，你在绕花轻舞，吹落一朵花于发间，就是你的问候。“东风随春归，发我枝上花。”仰望是一种姿态，仰望一朵花的高度，仰望一缕风的潺潺，若水的感觉，就在花间，在春风里恣意流淌成属于自己的春天。\n春风十里，那些散落在浪花里的呓语，那些随露珠滑落的念想，那些摇曳在风中隐隐而来的思念，打湿了哪一场春雨呢？那些微小的不易察觉的轻柔而过，是经年的执念，是一场又一场落幕后空空的剧院，耳边回荡着的是蒹葭青衣，刀马花旦。谁的围城里谁的雪域，在春风十里间，融化成涓涓细流。云水间，你又是轻歌曼舞的伊人呢，把每一寸光阴都焐热成一朵花散落在人间陌上。在一束束花开间，捧起那一朵娉婷的鹅黄。',
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/M500001VfvsJ21xFqb.mp3?guid=ffffffff82def4af4b12b3cd9337d5e7&uin=346897220&vkey=6292F51E1E384E06DCBDC9AB7C49FD713D632D313AC4858BACB8DDD29067D3C601481D36E62053BF8DFEAF74C0A5CCFADD6471160CAF3E6A&fromtag=46',
      title: '此时此刻-6',
      coverImgUrl: 'http://img06.tooopen.com/images/20160818/tooopen_sy_175866434296.jpg',
    }
  },
  
]
module.exports ={
  postList: local_database
}